import json

source = json.loads('{"黑龙江省":{"年薪":82725},"山西省":{"年薪":85845},"内蒙古自治区":{"年薪":88354},"甘肃省":{"年薪":90333},"吉林省":{"年薪":94295},"云南省":{"年薪":95043},"新疆维吾尔自治区":{"年薪":97145},"河北省":{"年薪":100731},"海南省":{"年薪":101510},"河南省":{"年薪":103525},"全国":{"年薪":104996},"广西壮族自治区":{"年薪":105015},"贵州省":{"年薪":105517},"江西省":{"年薪":107294},"深圳市":{"年薪":108000},"上海市":{"年薪":108000},"西藏自治区":{"年薪":110250},"山东省":{"年薪":116079},"在家办公":{"年薪":119100},"辽宁省":{"年薪":130780},"福建省":{"年薪":133965},"安徽省":{"年薪":138206},"天津":{"年薪":156458},"四川省":{"年薪":162836},"湖南省":{"年薪":162911},"湖北省":{"年薪":168150},"重庆":{"年薪":170454},"江苏省":{"年薪":174915},"广东省":{"年薪":196965},"陕西省":{"年薪":203172},"浙江省":{"年薪":239349},"北京":{"年薪":254824},"上海":{"年薪":255891}}')

for k,v in source.items():
    for i,j in v.items():
        result = dict()
        result["name"] = k
        result["value"] = j
        result = str(result)
        print(result + ",")
        